---
kind: type
id: T:Autodesk.Revit.DB.Instance
source: html/08603dd9-976d-a9fe-add7-2a8450b8006c.htm
---
# Autodesk.Revit.DB.Instance

The base class for all instance objects.

## Syntax (C#)
```csharp
public class Instance : Element
```